In [10]:
import pandas as pd

In [21]:
data = {'学生编号':['001', '002', '003', '004', '005', '006'],
'学生姓名':['学生1', '学生2', '学生3', '学生4', '学生5', '学生6'], '学生成绩':[1, 2, 3, 4, 5, 6]}

In [22]:
data

{'学生编号': ['001', '002', '003', '004', '005', '006'],
 '学生姓名': ['学生1', '学生2', '学生3', '学生4', '学生5', '学生6'],
 '学生成绩': [1, 2, 3, 4, 5, 6]}

In [23]:
df = pd.DataFrame(data)

In [24]:
df

  学生编号 学生姓名  学生成绩
0  001  学生1     1
1  002  学生2     2
2  003  学生3     3
3  004  学生4     4
4  005  学生5     5
5  006  学生6     6

In [25]:
df.head()

  学生编号 学生姓名  学生成绩
0  001  学生1     1
1  002  学生2     2
2  003  学生3     3
3  004  学生4     4
4  005  学生5     5

In [26]:
df = pd.DataFrame(data, columns=['学生姓名', '学生成绩', '学生编号'])

In [27]:
df

  学生姓名  学生成绩 学生编号
0  学生1     1  001
1  学生2     2  002
2  学生3     3  003
3  学生4     4  004
4  学生5     5  005
5  学生6     6  006

In [28]:
df = pd.DataFrame(data, index=['1', '2', '3', '4', '5', '6'])

In [29]:
df

  学生编号 学生姓名  学生成绩
1  001  学生1     1
2  002  学生2     2
3  003  学生3     3
4  004  学生4     4
5  005  学生5     5
6  006  学生6     6

In [30]:
df['学生姓名']

1    学生1
2    学生2
3    学生3
4    学生4
5    学生5
6    学生6
Name: 学生姓名, dtype: object

In [31]:
df.学生姓名

1    学生1
2    学生2
3    学生3
4    学生4
5    学生5
6    学生6
Name: 学生姓名, dtype: object

In [32]:
type(df['学生姓名'])

pandas.core.series.Series

In [33]:
df.loc['1']

学生编号    001
学生姓名    学生1
学生成绩      1
Name: 1, dtype: object

In [34]:
type(df.loc['1'])

pandas.core.series.Series